Infineon/psoc4pdl/devices/include/cy_device_headers.h
/***************************************************************************//**
* \file cy_device_headers.h
*
* \brief
* Common header file to be included by the drivers.
*
* \note
* Generator version: 1.6.0.163
*
********************************************************************************
* \copyright
* Copyright 2016-2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CY_DEVICE_HEADERS_H_
#define _CY_DEVICE_HEADERS_H_

#if defined (CY8C4024FNI_S402)
    #include "cy8c4024fni_s402.h"
#elif defined (CY8C4024LQI_S401)
    #include "cy8c4024lqi_s401.h"
#elif defined (CY8C4024LQI_S402)
    #include "cy8c4024lqi_s402.h"
#elif defined (CY8C4024AZI_S403)
    #include "cy8c4024azi_s403.h"
#elif defined (CY8C4024FNI_S412)
    #include "cy8c4024fni_s412.h"
#elif defined (CY8C4024LQI_S411)
    #include "cy8c4024lqi_s411.h"
#elif defined (CY8C4024LQI_S412)
    #include "cy8c4024lqi_s412.h"
#elif defined (CY8C4024AZI_S413)
    #include "cy8c4024azi_s413.h"
#elif defined (CY8C4025FNI_S402)
    #include "cy8c4025fni_s402.h"
#elif defined (CY8C4025LQI_S401)
    #include "cy8c4025lqi_s401.h"
#elif defined (CY8C4025LQI_S402)
    #include "cy8c4025lqi_s402.h"
#elif defined (CY8C4025AZI_S403)
    #include "cy8c4025azi_s403.h"
#elif defined (CY8C4025FNI_S412)
    #include "cy8c4025fni_s412.h"
#elif defined (CY8C4025LQI_S411)
    #include "cy8c4025lqi_s411.h"
#elif defined (CY8C4025LQI_S412)
    #include "cy8c4025lqi_s412.h"
#elif defined (CY8C4025AZI_S413)
    #include "cy8c4025azi_s413.h"
#elif defined (CY8C4045FNI_S412)
    #include "cy8c4045fni_s412.h"
#elif defined (CY8C4045LQI_S411)
    #include "cy8c4045lqi_s411.h"
#elif defined (CY8C4045LQI_S412)
    #include "cy8c4045lqi_s412.h"
#elif defined (CY8C4045AZI_S413)
    #include "cy8c4045azi_s413.h"
#elif defined (CY8C4024LQI_S403)
    #include "cy8c4024lqi_s403.h"
#elif defined (CY8C4024LQI_S413)
    #include "cy8c4024lqi_s413.h"
#elif defined (CY8C4124FNI_S403)
    #include "cy8c4124fni_s403.h"
#elif defined (CY8C4124FNI_S413)
    #include "cy8c4124fni_s413.h"
#elif defined (CY8C4124LQI_S412)
    #include "cy8c4124lqi_s412.h"
#elif defined (CY8C4124LQI_S413)
    #include "cy8c4124lqi_s413.h"
#elif defined (CY8C4124AZI_S413)
    #include "cy8c4124azi_s413.h"
#elif defined (CY8C4124FNI_S433)
    #include "cy8c4124fni_s433.h"
#elif defined (CY8C4124LQI_S432)
    #include "cy8c4124lqi_s432.h"
#elif defined (CY8C4124LQI_S433)
    #include "cy8c4124lqi_s433.h"
#elif defined (CY8C4124AZI_S433)
    #include "cy8c4124azi_s433.h"
#elif defined (CY8C4125FNI_S423)
    #include "cy8c4125fni_s423.h"
#elif defined (CY8C4125LQI_S422)
    #include "cy8c4125lqi_s422.h"
#elif defined (CY8C4125LQI_S423)
    #include "cy8c4125lqi_s423.h"
#elif defined (CY8C4125AZI_S423)
    #include "cy8c4125azi_s423.h"
#elif defined (CY8C4125FNI_S413)
    #include "cy8c4125fni_s413.h"
#elif defined (CY8C4125LQI_S412)
    #include "cy8c4125lqi_s412.h"
#elif defined (CY8C4125LQI_S413)
    #include "cy8c4125lqi_s413.h"
#elif defined (CY8C4125AZI_S413)
    #include "cy8c4125azi_s413.h"
#elif defined (CY8C4125FNI_S433)
    #include "cy8c4125fni_s433.h"
#elif defined (CY8C4125LQI_S432)
    #include "cy8c4125lqi_s432.h"
#elif defined (CY8C4125LQI_S433)
    #include "cy8c4125lqi_s433.h"
#elif defined (CY8C4125AZI_S433)
    #include "cy8c4125azi_s433.h"
#elif defined (CY8C4146FNI_S423)
    #include "cy8c4146fni_s423.h"
#elif defined (CY8C4146LQI_S422)
    #include "cy8c4146lqi_s422.h"
#elif defined (CY8C4146LQI_S423)
    #include "cy8c4146lqi_s423.h"
#elif defined (CY8C4146AZI_S423)
    #include "cy8c4146azi_s423.h"
#elif defined (CY8C4146FNI_S433)
    #include "cy8c4146fni_s433.h"
#elif defined (CY8C4146LQI_S432)
    #include "cy8c4146lqi_s432.h"
#elif defined (CY8C4146LQI_S433)
    #include "cy8c4146lqi_s433.h"
#elif defined (CY8C4146AZI_S433)
    #include "cy8c4146azi_s433.h"
#elif defined (CY8C4125AXI_S423)
    #include "cy8c4125axi_s423.h"
#elif defined (CY8C4125AXI_S433)
    #include "cy8c4125axi_s433.h"
#elif defined (CY8C4126AZI_S423)
    #include "cy8c4126azi_s423.h"
#elif defined (CY8C4126AZI_S433)
    #include "cy8c4126azi_s433.h"
#elif defined (CY8C4126AXI_S423)
    #include "cy8c4126axi_s423.h"
#elif defined (CY8C4126AXI_S433)
    #include "cy8c4126axi_s433.h"
#elif defined (CY8C4145AZI_S423)
    #include "cy8c4145azi_s423.h"
#elif defined (CY8C4145AXI_S423)
    #include "cy8c4145axi_s423.h"
#elif defined (CY8C4145AXI_S433)
    #include "cy8c4145axi_s433.h"
#elif defined (CY8C4146AXI_S423)
    #include "cy8c4146axi_s423.h"
#elif defined (CY8C4146AXI_S433)
    #include "cy8c4146axi_s433.h"
#elif defined (CY8C4124PVA_S412)
    #include "cy8c4124pva_s412.h"
#elif defined (CY8C4124LQA_S413)
    #include "cy8c4124lqa_s413.h"
#elif defined (CY8C4124PVA_S432)
    #include "cy8c4124pva_s432.h"
#elif defined (CY8C4124LQA_S423)
    #include "cy8c4124lqa_s423.h"
#elif defined (CY8C4124LQA_S433)
    #include "cy8c4124lqa_s433.h"
#elif defined (CY8C4125PVA_S412)
    #include "cy8c4125pva_s412.h"
#elif defined (CY8C4125LQA_S413)
    #include "cy8c4125lqa_s413.h"
#elif defined (CY8C4125PVA_S432)
    #include "cy8c4125pva_s432.h"
#elif defined (CY8C4125LQA_S433)
    #include "cy8c4125lqa_s433.h"
#elif defined (CY8C4146PVA_S422)
    #include "cy8c4146pva_s422.h"
#elif defined (CY8C4146PVA_S432)
    #include "cy8c4146pva_s432.h"
#elif defined (CY8C4146LQA_S433)
    #include "cy8c4146lqa_s433.h"
#elif defined (CY8C4124PVS_S412)
    #include "cy8c4124pvs_s412.h"
#elif defined (CY8C4124LQS_S413)
    #include "cy8c4124lqs_s413.h"
#elif defined (CY8C4124PVS_S432)
    #include "cy8c4124pvs_s432.h"
#elif defined (CY8C4124LQS_S433)
    #include "cy8c4124lqs_s433.h"
#elif defined (CY8C4125PVS_S412)
    #include "cy8c4125pvs_s412.h"
#elif defined (CY8C4125LQS_S413)
    #include "cy8c4125lqs_s413.h"
#elif defined (CY8C4125PVS_S432)
    #include "cy8c4125pvs_s432.h"
#elif defined (CY8C4125LQS_S433)
    #include "cy8c4125lqs_s433.h"
#elif defined (CY8C4146PVS_S422)
    #include "cy8c4146pvs_s422.h"
#elif defined (CY8C4146PVS_S432)
    #include "cy8c4146pvs_s432.h"
#elif defined (CY8C4146LQS_S433)
    #include "cy8c4146lqs_s433.h"
#elif defined (CY8C4124PVE_S412)
    #include "cy8c4124pve_s412.h"
#elif defined (CY8C4124LQE_S413)
    #include "cy8c4124lqe_s413.h"
#elif defined (CY8C4124PVE_S432)
    #include "cy8c4124pve_s432.h"
#elif defined (CY8C4124LQE_S433)
    #include "cy8c4124lqe_s433.h"
#elif defined (CY8C4125PVE_S412)
    #include "cy8c4125pve_s412.h"
#elif defined (CY8C4125LQE_S413)
    #include "cy8c4125lqe_s413.h"
#elif defined (CY8C4125PVE_S432)
    #include "cy8c4125pve_s432.h"
#elif defined (CY8C4125LQE_S433)
    #include "cy8c4125lqe_s433.h"
#elif defined (CY8C4146PVE_S422)
    #include "cy8c4146pve_s422.h"
#elif defined (CY8C4146PVE_S432)
    #include "cy8c4146pve_s432.h"
#elif defined (CY8C4146LQE_S433)
    #include "cy8c4146lqe_s433.h"
#elif defined (CY8C4024LQA_S411)
    #include "cy8c4024lqa_s411.h"
#elif defined (CY8C4024PVA_S411)
    #include "cy8c4024pva_s411.h"
#elif defined (CY8C4024PVA_S412)
    #include "cy8c4024pva_s412.h"
#elif defined (CY8C4025LQA_S411)
    #include "cy8c4025lqa_s411.h"
#elif defined (CY8C4025PVA_S411)
    #include "cy8c4025pva_s411.h"
#elif defined (CY8C4025PVA_S412)
    #include "cy8c4025pva_s412.h"
#elif defined (CY8C4045LQA_S411)
    #include "cy8c4045lqa_s411.h"
#elif defined (CY8C4045PVA_S411)
    #include "cy8c4045pva_s411.h"
#elif defined (CY8C4045PVA_S412)
    #include "cy8c4045pva_s412.h"
#elif defined (CY8C4024LQS_S411)
    #include "cy8c4024lqs_s411.h"
#elif defined (CY8C4024PVS_S411)
    #include "cy8c4024pvs_s411.h"
#elif defined (CY8C4024PVS_S412)
    #include "cy8c4024pvs_s412.h"
#elif defined (CY8C4025LQS_S411)
    #include "cy8c4025lqs_s411.h"
#elif defined (CY8C4025PVS_S411)
    #include "cy8c4025pvs_s411.h"
#elif defined (CY8C4025PVS_S412)
    #include "cy8c4025pvs_s412.h"
#elif defined (CY8C4045LQS_S411)
    #include "cy8c4045lqs_s411.h"
#elif defined (CY8C4045PVS_S411)
    #include "cy8c4045pvs_s411.h"
#elif defined (CY8C4045PVS_S412)
    #include "cy8c4045pvs_s412.h"
#elif defined (CY8C4124PVA_S422)
    #include "cy8c4124pva_s422.h"
#elif defined (CY8C4125PVA_S422)
    #include "cy8c4125pva_s422.h"
#elif defined (CY8C4124PVS_S422)
    #include "cy8c4124pvs_s422.h"
#elif defined (CY8C4125PVS_S422)
    #include "cy8c4125pvs_s422.h"
#elif defined (CY8C4124PVE_S422)
    #include "cy8c4124pve_s422.h"
#elif defined (CY8C4125PVE_S422)
    #include "cy8c4125pve_s422.h"
#elif defined (CY8C4126AXI_S443)
    #include "cy8c4126axi_s443.h"
#elif defined (CY8C4126AZI_S445)
    #include "cy8c4126azi_s445.h"
#elif defined (CY8C4126AXI_S445)
    #include "cy8c4126axi_s445.h"
#elif defined (CY8C4126AZI_S455)
    #include "cy8c4126azi_s455.h"
#elif defined (CY8C4126AXI_S455)
    #include "cy8c4126axi_s455.h"
#elif defined (CY8C4146AXI_S443)
    #include "cy8c4146axi_s443.h"
#elif defined (CY8C4146AZI_S445)
    #include "cy8c4146azi_s445.h"
#elif defined (CY8C4146AXI_S445)
    #include "cy8c4146axi_s445.h"
#elif defined (CY8C4146AXI_S453)
    #include "cy8c4146axi_s453.h"
#elif defined (CY8C4146AZI_S455)
    #include "cy8c4146azi_s455.h"
#elif defined (CY8C4146AXI_S455)
    #include "cy8c4146axi_s455.h"
#elif defined (CY8C4127AXI_S443)
    #include "cy8c4127axi_s443.h"
#elif defined (CY8C4127AZI_S445)
    #include "cy8c4127azi_s445.h"
#elif defined (CY8C4127AXI_S445)
    #include "cy8c4127axi_s445.h"
#elif defined (CY8C4127AXI_S453)
    #include "cy8c4127axi_s453.h"
#elif defined (CY8C4127AZI_S455)
    #include "cy8c4127azi_s455.h"
#elif defined (CY8C4127AXI_S455)
    #include "cy8c4127axi_s455.h"
#elif defined (CY8C4147AXI_S443)
    #include "cy8c4147axi_s443.h"
#elif defined (CY8C4147AZI_S445)
    #include "cy8c4147azi_s445.h"
#elif defined (CY8C4147AXI_S445)
    #include "cy8c4147axi_s445.h"
#elif defined (CY8C4147AXI_S453)
    #include "cy8c4147axi_s453.h"
#elif defined (CY8C4147AZI_S455)
    #include "cy8c4147azi_s455.h"
#elif defined (CY8C4147AXI_S455)
    #include "cy8c4147axi_s455.h"
#elif defined (CY8C4147AZI_S465)
    #include "cy8c4147azi_s465.h"
#elif defined (CY8C4147AXI_S465)
    #include "cy8c4147axi_s465.h"
#elif defined (CY8C4147AZI_S475)
    #include "cy8c4147azi_s475.h"
#elif defined (CY8C4147AXI_S475)
    #include "cy8c4147axi_s475.h"
#elif defined (CY8C4126AZA_S455)
    #include "cy8c4126aza_s455.h"
#elif defined (CY8C4146AZA_S455)
    #include "cy8c4146aza_s455.h"
#elif defined (CY8C4127AZA_S445)
    #include "cy8c4127aza_s445.h"
#elif defined (CY8C4127AZA_S455)
    #include "cy8c4127aza_s455.h"
#elif defined (CY8C4147AZA_S445)
    #include "cy8c4147aza_s445.h"
#elif defined (CY8C4147AZA_S455)
    #include "cy8c4147aza_s455.h"
#elif defined (CY8C4147AZA_S465)
    #include "cy8c4147aza_s465.h"
#elif defined (CY8C4147AZA_S475)
    #include "cy8c4147aza_s475.h"
#elif defined (CY8C4126AZS_S455)
    #include "cy8c4126azs_s455.h"
#elif defined (CY8C4146AZS_S455)
    #include "cy8c4146azs_s455.h"
#elif defined (CY8C4127AZS_S445)
    #include "cy8c4127azs_s445.h"
#elif defined (CY8C4127AZS_S455)
    #include "cy8c4127azs_s455.h"
#elif defined (CY8C4147AZS_S445)
    #include "cy8c4147azs_s445.h"
#elif defined (CY8C4147AZS_S455)
    #include "cy8c4147azs_s455.h"
#elif defined (CY8C4147AZS_S465)
    #include "cy8c4147azs_s465.h"
#elif defined (CY8C4147AZS_S475)
    #include "cy8c4147azs_s475.h"
#elif defined (CY8C4146AZA_S245)
    #include "cy8c4146aza_s245.h"
#elif defined (CY8C4146AZA_S255)
    #include "cy8c4146aza_s255.h"
#elif defined (CY8C4146AZA_S265)
    #include "cy8c4146aza_s265.h"
#elif defined (CY8C4146AZA_S275)
    #include "cy8c4146aza_s275.h"
#elif defined (CY8C4147AZA_S245)
    #include "cy8c4147aza_s245.h"
#elif defined (CY8C4147AZA_S255)
    #include "cy8c4147aza_s255.h"
#elif defined (CY8C4147AZA_S265)
    #include "cy8c4147aza_s265.h"
#elif defined (CY8C4147AZA_S275)
    #include "cy8c4147aza_s275.h"
#elif defined (CY8C4147AZA_S285)
    #include "cy8c4147aza_s285.h"
#elif defined (CY8C4147AZA_S295)
    #include "cy8c4147aza_s295.h"
#elif defined (CY8C4146AZS_S245)
    #include "cy8c4146azs_s245.h"
#elif defined (CY8C4146AZS_S255)
    #include "cy8c4146azs_s255.h"
#elif defined (CY8C4146AZS_S265)
    #include "cy8c4146azs_s265.h"
#elif defined (CY8C4146AZS_S275)
    #include "cy8c4146azs_s275.h"
#elif defined (CY8C4147AZS_S245)
    #include "cy8c4147azs_s245.h"
#elif defined (CY8C4147AZS_S255)
    #include "cy8c4147azs_s255.h"
#elif defined (CY8C4147AZS_S265)
    #include "cy8c4147azs_s265.h"
#elif defined (CY8C4147AZS_S275)
    #include "cy8c4147azs_s275.h"
#elif defined (CY8C4147AZS_S285)
    #include "cy8c4147azs_s285.h"
#elif defined (CY8C4147AZS_S295)
    #include "cy8c4147azs_s295.h"
#elif defined (CY8C4024AXI_S402)
    #include "cy8c4024axi_s402.h"
#elif defined (CY8C4024AXI_S412)
    #include "cy8c4024axi_s412.h"
#elif defined (CY8C4025AXI_S402)
    #include "cy8c4025axi_s402.h"
#elif defined (CY8C4025AXI_S412)
    #include "cy8c4025axi_s412.h"
#elif defined (CY8C4045AXI_S412)
    #include "cy8c4045axi_s412.h"
#elif defined (CY8C4547AZI_445)
    #include "cy8c4547azi_445.h"
#elif defined (CY8C4125LQA_S423)
    #include "cy8c4125lqa_s423.h"
#elif defined (CY8C4146LQA_S423)
    #include "cy8c4146lqa_s423.h"
#elif defined (CY8C4124LQS_S423)
    #include "cy8c4124lqs_s423.h"
#elif defined (CY8C4125LQS_S423)
    #include "cy8c4125lqs_s423.h"
#elif defined (CY8C4146LQS_S423)
    #include "cy8c4146lqs_s423.h"
#elif defined (CY8C4124LQE_S423)
    #include "cy8c4124lqe_s423.h"
#elif defined (CY8C4125LQE_S423)
    #include "cy8c4125lqe_s423.h"
#elif defined (CY8C4146LQE_S423)
    #include "cy8c4146lqe_s423.h"
#elif defined (CY8C4146AZI_S443)
    #include "cy8c4146azi_s443.h"
#elif defined (CY8C4146AZI_S453)
    #include "cy8c4146azi_s453.h"
#elif defined (CY8C4146AZI_S463)
    #include "cy8c4146azi_s463.h"
#elif defined (CY8C4127AZI_S443)
    #include "cy8c4127azi_s443.h"
#elif defined (CY8C4127AZI_S453)
    #include "cy8c4127azi_s453.h"
#elif defined (CY8C4147AZI_S443)
    #include "cy8c4147azi_s443.h"
#elif defined (CY8C4147AZI_S453)
    #include "cy8c4147azi_s453.h"
#elif defined (CY8C4147AZI_S463)
    #include "cy8c4147azi_s463.h"
#elif defined (CY8C4146AZQ_S445)
    #include "cy8c4146azq_s445.h"
#elif defined (CY8C4146AZQ_S455)
    #include "cy8c4146azq_s455.h"
#elif defined (CY8C4127AZQ_S445)
    #include "cy8c4127azq_s445.h"
#elif defined (CY8C4147AZQ_S445)
    #include "cy8c4147azq_s445.h"
#elif defined (CY8C4127AZQ_S455)
    #include "cy8c4127azq_s455.h"
#elif defined (CY8C4147AZQ_S455)
    #include "cy8c4147azq_s455.h"
#elif defined (CY8C4147AZQ_S465)
    #include "cy8c4147azq_s465.h"
#elif defined (CY8C4147AZQ_S475)
    #include "cy8c4147azq_s475.h"
#elif defined (CY8C4126AZE_S455)
    #include "cy8c4126aze_s455.h"
#elif defined (CY8C4146AZE_S245)
    #include "cy8c4146aze_s245.h"
#elif defined (CY8C4146AZE_S255)
    #include "cy8c4146aze_s255.h"
#elif defined (CY8C4146AZE_S265)
    #include "cy8c4146aze_s265.h"
#elif defined (CY8C4146AZE_S275)
    #include "cy8c4146aze_s275.h"
#elif defined (CY8C4146AZE_S455)
    #include "cy8c4146aze_s455.h"
#elif defined (CY8C4127AZE_S445)
    #include "cy8c4127aze_s445.h"
#elif defined (CY8C4127AZE_S455)
    #include "cy8c4127aze_s455.h"
#elif defined (CY8C4147AZE_S245)
    #include "cy8c4147aze_s245.h"
#elif defined (CY8C4147AZE_S255)
    #include "cy8c4147aze_s255.h"
#elif defined (CY8C4147AZE_S265)
    #include "cy8c4147aze_s265.h"
#elif defined (CY8C4147AZE_S275)
    #include "cy8c4147aze_s275.h"
#elif defined (CY8C4147AZE_S285)
    #include "cy8c4147aze_s285.h"
#elif defined (CY8C4147AZE_S295)
    #include "cy8c4147aze_s295.h"
#elif defined (CY8C4147AZE_S445)
    #include "cy8c4147aze_s445.h"
#elif defined (CY8C4147AZE_S455)
    #include "cy8c4147aze_s455.h"
#elif defined (CY8C4147AZE_S465)
    #include "cy8c4147aze_s465.h"
#elif defined (CY8C4147AZE_S475)
    #include "cy8c4147aze_s475.h"
#elif defined (CY8C4126LQA_S453)
    #include "cy8c4126lqa_s453.h"
#elif defined (CY8C4146LQA_S243)
    #include "cy8c4146lqa_s243.h"
#elif defined (CY8C4146LQA_S253)
    #include "cy8c4146lqa_s253.h"
#elif defined (CY8C4146LQA_S263)
    #include "cy8c4146lqa_s263.h"
#elif defined (CY8C4146LQA_S273)
    #include "cy8c4146lqa_s273.h"
#elif defined (CY8C4146LQA_S453)
    #include "cy8c4146lqa_s453.h"
#elif defined (CY8C4127LQA_S443)
    #include "cy8c4127lqa_s443.h"
#elif defined (CY8C4127LQA_S453)
    #include "cy8c4127lqa_s453.h"
#elif defined (CY8C4147LQA_S243)
    #include "cy8c4147lqa_s243.h"
#elif defined (CY8C4147LQA_S253)
    #include "cy8c4147lqa_s253.h"
#elif defined (CY8C4147LQA_S263)
    #include "cy8c4147lqa_s263.h"
#elif defined (CY8C4147LQA_S273)
    #include "cy8c4147lqa_s273.h"
#elif defined (CY8C4147LQA_S283)
    #include "cy8c4147lqa_s283.h"
#elif defined (CY8C4147LQA_S293)
    #include "cy8c4147lqa_s293.h"
#elif defined (CY8C4147LQA_S443)
    #include "cy8c4147lqa_s443.h"
#elif defined (CY8C4147LQA_S453)
    #include "cy8c4147lqa_s453.h"
#elif defined (CY8C4147LQA_S463)
    #include "cy8c4147lqa_s463.h"
#elif defined (CY8C4147LQA_S473)
    #include "cy8c4147lqa_s473.h"
#elif defined (CY8C4126LQS_S453)
    #include "cy8c4126lqs_s453.h"
#elif defined (CY8C4146LQS_S243)
    #include "cy8c4146lqs_s243.h"
#elif defined (CY8C4146LQS_S253)
    #include "cy8c4146lqs_s253.h"
#elif defined (CY8C4146LQS_S263)
    #include "cy8c4146lqs_s263.h"
#elif defined (CY8C4146LQS_S273)
    #include "cy8c4146lqs_s273.h"
#elif defined (CY8C4146LQS_S453)
    #include "cy8c4146lqs_s453.h"
#elif defined (CY8C4127LQS_S443)
    #include "cy8c4127lqs_s443.h"
#elif defined (CY8C4127LQS_S453)
    #include "cy8c4127lqs_s453.h"
#elif defined (CY8C4147LQS_S243)
    #include "cy8c4147lqs_s243.h"
#elif defined (CY8C4147LQS_S253)
    #include "cy8c4147lqs_s253.h"
#elif defined (CY8C4147LQS_S263)
    #include "cy8c4147lqs_s263.h"
#elif defined (CY8C4147LQS_S273)
    #include "cy8c4147lqs_s273.h"
#elif defined (CY8C4147LQS_S283)
    #include "cy8c4147lqs_s283.h"
#elif defined (CY8C4147LQS_S293)
    #include "cy8c4147lqs_s293.h"
#elif defined (CY8C4147LQS_S443)
    #include "cy8c4147lqs_s443.h"
#elif defined (CY8C4147LQS_S453)
    #include "cy8c4147lqs_s453.h"
#elif defined (CY8C4147LQS_S463)
    #include "cy8c4147lqs_s463.h"
#elif defined (CY8C4147LQS_S473)
    #include "cy8c4147lqs_s473.h"
#elif defined (CY8C4126LQE_S453)
    #include "cy8c4126lqe_s453.h"
#elif defined (CY8C4146LQE_S243)
    #include "cy8c4146lqe_s243.h"
#elif defined (CY8C4146LQE_S253)
    #include "cy8c4146lqe_s253.h"
#elif defined (CY8C4146LQE_S263)
    #include "cy8c4146lqe_s263.h"
#elif defined (CY8C4146LQE_S273)
    #include "cy8c4146lqe_s273.h"
#elif defined (CY8C4146LQE_S453)
    #include "cy8c4146lqe_s453.h"
#elif defined (CY8C4127LQE_S443)
    #include "cy8c4127lqe_s443.h"
#elif defined (CY8C4127LQE_S453)
    #include "cy8c4127lqe_s453.h"
#elif defined (CY8C4147LQE_S243)
    #include "cy8c4147lqe_s243.h"
#elif defined (CY8C4147LQE_S253)
    #include "cy8c4147lqe_s253.h"
#elif defined (CY8C4147LQE_S263)
    #include "cy8c4147lqe_s263.h"
#elif defined (CY8C4147LQE_S273)
    #include "cy8c4147lqe_s273.h"
#elif defined (CY8C4147LQE_S283)
    #include "cy8c4147lqe_s283.h"
#elif defined (CY8C4147LQE_S293)
    #include "cy8c4147lqe_s293.h"
#elif defined (CY8C4147LQE_S443)
    #include "cy8c4147lqe_s443.h"
#elif defined (CY8C4147LQE_S453)
    #include "cy8c4147lqe_s453.h"
#elif defined (CY8C4147LQE_S463)
    #include "cy8c4147lqe_s463.h"
#elif defined (CY8C4147LQE_S473)
    #include "cy8c4147lqe_s473.h"
#elif defined (CY8C4126AZQ_S423)
    #include "cy8c4126azq_s423.h"
#elif defined (CY8C4126AZQ_S433)
    #include "cy8c4126azq_s433.h"
#elif defined (CY8C4146AZQ_S423)
    #include "cy8c4146azq_s423.h"
#elif defined (CY8C4146AZQ_S433)
    #include "cy8c4146azq_s433.h"
#elif defined (CY8C4125AZQ_S433)
    #include "cy8c4125azq_s433.h"
#elif defined (CY8C4145AZQ_S433)
    #include "cy8c4145azq_s433.h"
#elif defined (CY8C4025LQI_S403)
    #include "cy8c4025lqi_s403.h"
#elif defined (CY8C4025LQI_S413)
    #include "cy8c4025lqi_s413.h"
#elif defined (CY8C4045LQI_S413)
    #include "cy8c4045lqi_s413.h"
#elif defined (CY8C4025AZQ_S403)
    #include "cy8c4025azq_s403.h"
#elif defined (CY8C4024AZQ_S413)
    #include "cy8c4024azq_s413.h"
#elif defined (CY8C4025AZQ_S413)
    #include "cy8c4025azq_s413.h"
#elif defined (CY8C4045AZQ_S413)
    #include "cy8c4045azq_s413.h"
#elif defined (CY8C4145AXQ_S433)
    #include "cy8c4145axq_s433.h"
#elif defined (CY8C4126AXQ_S433)
    #include "cy8c4126axq_s433.h"
#elif defined (CY8C4146AXQ_S423)
    #include "cy8c4146axq_s423.h"
#elif defined (CY8C4146AXQ_S433)
    #include "cy8c4146axq_s433.h"
#elif defined (CY8C4546AZI_S473)
    #include "cy8c4546azi_s473.h"
#elif defined (CY8C4546AZI_S475)
    #include "cy8c4546azi_s475.h"
#elif defined (CY8C4546AXI_S475)
    #include "cy8c4546axi_s475.h"
#elif defined (CY8C4547AZI_S453)
    #include "cy8c4547azi_s453.h"
#elif defined (CY8C4547AZI_S455)
    #include "cy8c4547azi_s455.h"
#elif defined (CY8C4547AZI_S463)
    #include "cy8c4547azi_s463.h"
#elif defined (CY8C4547AZI_S465)
    #include "cy8c4547azi_s465.h"
#elif defined (CY8C4547AZI_S473)
    #include "cy8c4547azi_s473.h"
#elif defined (CY8C4547AZI_S475)
    #include "cy8c4547azi_s475.h"
#elif defined (CY8C4547AXI_S475)
    #include "cy8c4547axi_s475.h"
#elif defined (CY8C4548AZI_S475)
    #include "cy8c4548azi_s475.h"
#elif defined (CY8C4548AXI_S475)
    #include "cy8c4548axi_s475.h"
#elif defined (CY8C4548AZI_S483)
    #include "cy8c4548azi_s483.h"
#elif defined (CY8C4548AZI_S485)
    #include "cy8c4548azi_s485.h"
#elif defined (CY8C4548AXI_S485)
    #include "cy8c4548axi_s485.h"
#elif defined (CY8C4128AZI_S443)
    #include "cy8c4128azi_s443.h"
#elif defined (CY8C4128AZI_S445)
    #include "cy8c4128azi_s445.h"
#elif defined (CY8C4128AXI_S445)
    #include "cy8c4128axi_s445.h"
#elif defined (CY8C4128AZI_S453)
    #include "cy8c4128azi_s453.h"
#elif defined (CY8C4128AZI_S455)
    #include "cy8c4128azi_s455.h"
#elif defined (CY8C4128AXI_S455)
    #include "cy8c4128axi_s455.h"
#elif defined (CY8C4148AZI_S443)
    #include "cy8c4148azi_s443.h"
#elif defined (CY8C4148AZI_S445)
    #include "cy8c4148azi_s445.h"
#elif defined (CY8C4148AXI_S445)
    #include "cy8c4148axi_s445.h"
#elif defined (CY8C4148AZI_S453)
    #include "cy8c4148azi_s453.h"
#elif defined (CY8C4148AZI_S455)
    #include "cy8c4148azi_s455.h"
#elif defined (CY8C4148AXI_S455)
    #include "cy8c4148axi_s455.h"
#elif defined (CY8C4547AZQ_S453)
    #include "cy8c4547azq_s453.h"
#elif defined (CY8C4547AZQ_S455)
    #include "cy8c4547azq_s455.h"
#elif defined (CY8C4547AZQ_S473)
    #include "cy8c4547azq_s473.h"
#elif defined (CY8C4547AZQ_S475)
    #include "cy8c4547azq_s475.h"
#elif defined (CY8C4547AXQ_S475)
    #include "cy8c4547axq_s475.h"
#elif defined (CY8C4548AZQ_S483)
    #include "cy8c4548azq_s483.h"
#elif defined (CY8C4548AZQ_S485)
    #include "cy8c4548azq_s485.h"
#elif defined (CY8C4548AXQ_S485)
    #include "cy8c4548axq_s485.h"
#elif defined (CY8C4148AZQ_S443)
    #include "cy8c4148azq_s443.h"
#elif defined (CY8C4148AZQ_S445)
    #include "cy8c4148azq_s445.h"
#elif defined (CY8C4148AXQ_S445)
    #include "cy8c4148axq_s445.h"
#elif defined (CY8C4148AZQ_S453)
    #include "cy8c4148azq_s453.h"
#elif defined (CY8C4148AZQ_S455)
    #include "cy8c4148azq_s455.h"
#elif defined (CY8C4148AXQ_S455)
    #include "cy8c4148axq_s455.h"
#elif defined (CY8C4724FNI_S402)
    #include "cy8c4724fni_s402.h"
#elif defined (CY8C4724LQI_S401)
    #include "cy8c4724lqi_s401.h"
#elif defined (CY8C4725FNI_S402)
    #include "cy8c4725fni_s402.h"
#elif defined (CY8C4725LQI_S401)
    #include "cy8c4725lqi_s401.h"
#elif defined (CY8C4744FNI_S402)
    #include "cy8c4744fni_s402.h"
#elif defined (CY8C4744LQI_S401)
    #include "cy8c4744lqi_s401.h"
#elif defined (CY8C4744AZI_S403)
    #include "cy8c4744azi_s403.h"
#elif defined (CY8C4745FNI_S402)
    #include "cy8c4745fni_s402.h"
#elif defined (CY8C4745LQI_S401)
    #include "cy8c4745lqi_s401.h"
#elif defined (CY8C4745AZI_S403)
    #include "cy8c4745azi_s403.h"
#elif defined (CY8C4745FNI_S412)
    #include "cy8c4745fni_s412.h"
#elif defined (CY8C4745LQI_S411)
    #include "cy8c4745lqi_s411.h"
#elif defined (CY8C4745AZI_S413)
    #include "cy8c4745azi_s413.h"
#else
    #error Undefined part number
#endif

#endif /* _CY_DEVICE_HEADERS_H_ */


/* [] END OF FILE */
